app/views/lawyers/_form.html.erb

SELECT "states".* FROM "states"
---

    <%= f.select :state_id, options_for_select(State.all.map{|s|[s.uf, s.id]}), {include_blank: "Select State"}, { :class => 'form-control' } %>