app/views/devise/registrations/new.html.erb

SELECT "states".* FROM "states"
---
    <%= f.label :state %><br />
  <%= f.select :state_id, options_for_select(State.all.map{|s|[s.uf, s.id]}), {include_blank: "Select State"}, { :class => 'form-control' } %>