app/controllers/lawyers_controller.rb

  def index
    @lawyers = Lawyer.all
---
SELECT "lawyers".* FROM "lawyers"

  def create
    @lawyer = Lawyer.new(lawyer_params)

    respond_to do |format|
      if @lawyer.save
---
INSERT INTO "lawyers" ("name", "state_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "denis"], ["state_id", 1], ["created_at", "2019-10-13 18:35:23.257468"], ["updated_at", "2019-10-13 18:35:23.257468"]]

    def set_lawyer
      @lawyer = Lawyer.find(params[:id])
---
SELECT "lawyers".* FROM "lawyers" WHERE "lawyers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]