app/controllers/requests_controller.rb

  def index
    @requests = Request.where(["user_id = ?", current_user.id])
---
SELECT "requests".* FROM "requests" WHERE (current_user) ORDER BY "requests"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @request = Request.new(request_params)


    client = current_user
    state_id = client.state_id

    if !client.lawyer_id

      lawyers = Lawyer.where(["state_id = ?", state_id])

      if lawyers.any?

        last_count = 1000
        min_id = 0

        lawyers.each do |lawyer|

         curr_count =  User.where(["lawyer_id = ?", lawyer.id]).count
         p curr_count

         if curr_count < last_count
           min_id = lawyer.id
           last_count = curr_count
        else
         end
       end

        lawyer = Lawyer.find(min_id)
        client.lawyer_id = lawyer.id
        client.save!
---
SELECT "lawyers".* FROM "lawyers" WHERE (state_id) ORDER BY "lawyers"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "users" SET "lawyer_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["lawyer_id", 1], ["updated_at", "2019-10-13 18:36:25.401175"], ["id", 1]]

   @request.user = client

   respond_to do |format|
    if @request.save
---
INSERT INTO "requests" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Indenização"], ["user_id", 1], ["created_at", "2019-10-13 18:36:25.638783"], ["updated_at", "2019-10-13 18:36:25.638783"]]

  def destroy
    @request.destroy
---
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 3]]

    def set_request
      @request = Request.find(params[:id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]