app/controllers/states_controller.rb

  def index
    @states = State.all
---
SELECT "states".* FROM "states"

  def create
    @state = State.new(state_params)

    respond_to do |format|
      if @state.save
---
INSERT INTO "states" ("uf", "created_at", "updated_at") VALUES (?, ?, ?)  [["uf", "CE"], ["created_at", "2019-10-13 18:33:36.116006"], ["updated_at", "2019-10-13 18:33:36.116006"]]

    def set_state
      @state = State.find(params[:id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]